balazsgrill/modembed/res/Devices/dsPIC33/PIC24HJ128GP506A.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="24xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="PIC24HJ128GP506A" edc:procid="0xc7" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.500" edc:minvoltage="3.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.500" edc:maxvoltage="3.500" edc:mindefaultvoltage="3.000" edc:minvoltage="3.000" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="10000" edc:eedata="10000" edc:erase="600" edc:pgm="1000" edc:userid="10000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="64"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="24xxxx" edc:name="24xxxx">
    <edc:MemTraits>
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:CodeGuard>
    <edc:SegRegion edc:segregion="Data">
      <edc:Seg edc:seg="Boot">
        <edc:SegNature edc:addr="0x1c00" edc:id="DataBootLarge" edc:segsecurity="None" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x1c00" edc:id="LarBootRam" edc:segsecurity="None" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x1f00" edc:id="DataBootMed" edc:segsecurity="None" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x1f00" edc:id="MedBootRam" edc:segsecurity="None" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x1f80" edc:id="DataBootSmall" edc:segsecurity="None" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x1f80" edc:id="SmallBootRam" edc:segsecurity="None" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="DataBootNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x0" edc:id="NoBootRam" edc:segsecurity="None" edc:segsize="None"/>
      </edc:Seg>
      <edc:Seg edc:seg="Secure">
        <edc:SegNature edc:addr="0x1000" edc:id="DataSecureLarge" edc:segsecurity="None" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x1000" edc:id="LarSecRam" edc:segsecurity="None" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x1800" edc:id="DataSecureMed" edc:segsecurity="None" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x1800" edc:id="MedSecRam" edc:segsecurity="None" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x1f00" edc:id="DataSecureSmall" edc:segsecurity="None" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x1f00" edc:id="SmallSecRam" edc:segsecurity="None" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="DataSecureNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x0" edc:id="NoSecRam" edc:segsecurity="None" edc:segsize="None"/>
      </edc:Seg>
      <edc:Seg edc:seg="General"/>
    </edc:SegRegion>
    <edc:SegRegion edc:segregion="Program">
      <edc:Seg edc:seg="Boot">
        <edc:SegNature edc:addr="0x3ffe" edc:id="PgmBootHighLarge" edc:segsecurity="High" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x3ffe" edc:id="HiLarBootCode" edc:segsecurity="High" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmBootHighMed" edc:segsecurity="High" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x1ffe" edc:id="HiMedBootCode" edc:segsecurity="High" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x7fe" edc:id="PgmBootHighSm" edc:segsecurity="High" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x7fe" edc:id="HiSmBootCode" edc:segsecurity="High" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x3ffe" edc:id="PgmBootStdLarge" edc:segsecurity="Standard" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x3ffe" edc:id="StdLarBootCode" edc:segsecurity="Standard" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x1ffe" edc:id="PgmBootStdMed" edc:segsecurity="Standard" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x1ffe" edc:id="StdMedBootCode" edc:segsecurity="Standard" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x7fe" edc:id="PgmBootStdSm" edc:segsecurity="Standard" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x7fe" edc:id="StdSmBootCode" edc:segsecurity="Standard" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="PgmBootNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x0" edc:id="NoBootCode" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmBootWrtProtectOff" edc:enableid="PgmBootWrtProtectOn"/>
      </edc:Seg>
      <edc:Seg edc:seg="Secure">
        <edc:SegNature edc:addr="0xfffe" edc:id="PgmSecureHighLarge" edc:segsecurity="High" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0xfffe" edc:id="HiLarSecCode" edc:segsecurity="High" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x7ffe" edc:id="PgmSecureHighMed" edc:segsecurity="High" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x7ffe" edc:id="HiMedSecCode" edc:segsecurity="High" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x3ffe" edc:id="PgmSecureHighSm" edc:segsecurity="High" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x3ffe" edc:id="HiSmSecCode" edc:segsecurity="High" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0xfffe" edc:id="PgmSecureStdLarge" edc:segsecurity="Standard" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0xfffe" edc:id="StdLarSecCode" edc:segsecurity="Standard" edc:segsize="Large"/>
        <edc:SegNature edc:addr="0x7ffe" edc:id="PgmSecureStdMed" edc:segsecurity="Standard" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x7ffe" edc:id="StdMedSecCode" edc:segsecurity="Standard" edc:segsize="Medium"/>
        <edc:SegNature edc:addr="0x3ffe" edc:id="PgmSecureStdSm" edc:segsecurity="Standard" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x3ffe" edc:id="StdSmSecCode" edc:segsecurity="Standard" edc:segsize="Small"/>
        <edc:SegNature edc:addr="0x0" edc:id="PgmSecureNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x0" edc:id="NoSecCode" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmSecureWrtProtectOff" edc:enableid="PgmSecureWrtProtectOn"/>
      </edc:Seg>
      <edc:Seg edc:seg="General">
        <edc:SegNature edc:addr="0x157fe" edc:id="PgmGenHigh" edc:segsecurity="High" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x157fe" edc:id="PgmGenStd" edc:segsecurity="Standard" edc:segsize="None"/>
        <edc:SegNature edc:addr="0x157fe" edc:id="PgmGenNone" edc:segsecurity="None" edc:segsize="None"/>
        <edc:SegWriteProtect edc:disableid="PgmGenWrtProtectOff" edc:enableid="PgmGenWrtProtectOn"/>
      </edc:Seg>
    </edc:SegRegion>
  </edc:CodeGuard>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap Vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address Error Trap Vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap Vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap Vector"/>
    <edc:Trap edc:cname="DMACError" edc:desc="DMAC Error Trap Vector"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Reserved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="INT0 - External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="IC1 - Input Compare 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="OC1 - Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="T1 - Timer1" edc:irq="3"/>
    <edc:Interrupt edc:cname="DMA0Interrupt" edc:desc="DMA0 - DMA Channel 0" edc:irq="4"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="IC2 - Input Capture 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="OC2 - Output Compare 2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="T2 - Timer2" edc:irq="7"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="T3 - Timer3" edc:irq="8"/>
    <edc:Interrupt edc:cname="SPI1ErrInterrupt" edc:desc="SPI1E - SPI1 Error" edc:irq="9"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 - SPI1 Transfer Done" edc:irq="10"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="U1RX - UART1 Receiver" edc:irq="11"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="U1TX - UART1 Transmitter" edc:irq="12"/>
    <edc:Interrupt edc:cname="ADC1Interrupt" edc:desc="ADC1 - A/D Converter 1" edc:irq="13"/>
    <edc:Interrupt edc:cname="DMA1Interrupt" edc:desc="DMA1 - DMA Channel 1" edc:irq="14"/>
    <edc:Interrupt edc:cname="SI2C1Interrupt" edc:desc="SI2C1 - I2C1 Slave Events" edc:irq="16"/>
    <edc:Interrupt edc:cname="MI2C1Interrupt" edc:desc="MI2C1 - I2C1 Master Events" edc:irq="17"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="Change Notification Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="INT1 - External Interrupt 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="IC7Interrupt" edc:desc="IC7 - Input Capture 7" edc:irq="22"/>
    <edc:Interrupt edc:cname="IC8Interrupt" edc:desc="IC8 - Input Capture 8" edc:irq="23"/>
    <edc:Interrupt edc:cname="DMA2Interrupt" edc:desc="DMA2 - DMA Channel 2" edc:irq="24"/>
    <edc:Interrupt edc:cname="OC3Interrupt" edc:desc="OC3 - Output Compare 3" edc:irq="25"/>
    <edc:Interrupt edc:cname="OC4Interrupt" edc:desc="OC4 - Output Compare 4" edc:irq="26"/>
    <edc:Interrupt edc:cname="T4Interrupt" edc:desc="T4 - Timer4" edc:irq="27"/>
    <edc:Interrupt edc:cname="T5Interrupt" edc:desc="T5 - Timer5" edc:irq="28"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="INT2 - External Interrupt 2" edc:irq="29"/>
    <edc:Interrupt edc:cname="U2RXInterrupt" edc:desc="U2RX - UART2 Receiver" edc:irq="30"/>
    <edc:Interrupt edc:cname="U2TXInterrupt" edc:desc="U2TX - UART2 Transmitter" edc:irq="31"/>
    <edc:Interrupt edc:cname="SPI2ErrInterrupt" edc:desc="SPI2E - SPI2 Error" edc:irq="32"/>
    <edc:Interrupt edc:cname="SPI2Interrupt" edc:desc="SPI2 - SPI2 Transfer Done" edc:irq="33"/>
    <edc:Interrupt edc:cname="C1RxRdyInterrupt" edc:desc="C1RX - ECAN1 Receive Data Ready" edc:irq="34"/>
    <edc:Interrupt edc:cname="C1Interrupt" edc:desc="C1 - ECAN1 Event" edc:irq="35"/>
    <edc:Interrupt edc:cname="DMA3Interrupt" edc:desc="DMA3 - DMA Channel 3" edc:irq="36"/>
    <edc:Interrupt edc:cname="IC3Interrupt" edc:desc="IC3 - Input Capture 3" edc:irq="37"/>
    <edc:Interrupt edc:cname="IC4Interrupt" edc:desc="IC4 - Input Capture 4" edc:irq="38"/>
    <edc:Interrupt edc:cname="IC5Interrupt" edc:desc="IC5 - Input Capture 5" edc:irq="39"/>
    <edc:Interrupt edc:cname="IC6Interrupt" edc:desc="IC6 - Input Capture 6" edc:irq="40"/>
    <edc:Interrupt edc:cname="OC5Interrupt" edc:desc="OC5 - Output Compare 5" edc:irq="41"/>
    <edc:Interrupt edc:cname="OC6Interrupt" edc:desc="OC6 - Output Compare 6" edc:irq="42"/>
    <edc:Interrupt edc:cname="OC7Interrupt" edc:desc="OC7 - Output Compare 7" edc:irq="43"/>
    <edc:Interrupt edc:cname="OC8Interrupt" edc:desc="OC8 - Output Compare 8" edc:irq="44"/>
    <edc:Interrupt edc:cname="DMA4Interrupt" edc:desc="DMA4 - DMA Channel 4" edc:irq="46"/>
    <edc:Interrupt edc:cname="T6Interrupt" edc:desc="T6 - Timer6" edc:irq="47"/>
    <edc:Interrupt edc:cname="T7Interrupt" edc:desc="T7 - Timer7" edc:irq="48"/>
    <edc:Interrupt edc:cname="SI2C2Interrupt" edc:desc="SI2C2 - I2C2 Slave Events" edc:irq="49"/>
    <edc:Interrupt edc:cname="MI2C2Interrupt" edc:desc="MI2C2 - I2C2 Master Events" edc:irq="50"/>
    <edc:Interrupt edc:cname="T8Interrupt" edc:desc="T8 - Timer8" edc:irq="51"/>
    <edc:Interrupt edc:cname="T9Interrupt" edc:desc="T9 - Timer9" edc:irq="52"/>
    <edc:Interrupt edc:cname="INT3Interrupt" edc:desc="INT3 - External Interrupt 3" edc:irq="53"/>
    <edc:Interrupt edc:cname="INT4Interrupt" edc:desc="INT4 - External Interrupt 4" edc:irq="54"/>
    <edc:Interrupt edc:cname="DCIErrInterrupt" edc:desc="DCIE - DCI Error" edc:irq="59"/>
    <edc:Interrupt edc:cname="DCIInterrupt" edc:desc="DCID - DCI Transfer Done" edc:irq="60"/>
    <edc:Interrupt edc:cname="U1ErrInterrupt" edc:desc="U1E - UART1 Error" edc:irq="65"/>
    <edc:Interrupt edc:cname="U2ErrInterrupt" edc:desc="U2E - UART2 Error" edc:irq="66"/>
    <edc:Interrupt edc:cname="DMA6Interrupt" edc:desc="DMA6 - DMA Channel 6" edc:irq="68"/>
    <edc:Interrupt edc:cname="DMA7Interrupt" edc:desc="DMA7 - DMA Channel 7" edc:irq="69"/>
    <edc:Interrupt edc:cname="C1TxReqInterrupt" edc:desc="ECAN1 Transmit Data Request" edc:irq="70"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x6" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x100" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x104" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x104" edc:endaddr="0x200" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0x15800" edc:regionid="program"/>
    <edc:TestZone edc:appbeginaddr="0x800080" edc:appendaddr="0x8005c0" edc:beginaddr="0x800000" edc:endaddr="0x801000" edc:regionid="testmem"/>
    <edc:ConfigFuseSector edc:beginaddr="0xf80000" edc:endaddr="0xf80010" edc:regionid="cfgmem">
      <edc:DCRDef edc:access="--------nn--nnnn" edc:cname="FBS" edc:default="0xcf" edc:desc="" edc:impl="0xcf" edc:name="FBS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xcf">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="BWRP" edc:desc="Boot Segment Write Protect" edc:mask="0x1" edc:name="BWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WRPROTECT_OFF" edc:codeguardidref="PgmBootWrtProtectOff" edc:desc="Boot Segment may be written" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WRPROTECT_ON" edc:codeguardidref="PgmBootWrtProtectOn" edc:desc="Boot segment is write-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BSS" edc:desc="Boot Segment Program Flash Code Protection" edc:mask="0x7" edc:name="BSS" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="NO_FLASH" edc:codeguardidref="PgmBootNone" edc:desc="No Boot program Flash segment" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="NO_BOOT_CODE" edc:codeguardidref="NoBootCode" edc:desc="No Boot program Flash segment" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_FLASH_STD" edc:codeguardidref="PgmBootStdSm" edc:desc="Standard Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="STRD_SMALL_BOOT_CODE" edc:codeguardidref="StdSmBootCode" edc:desc="Standard Security, Small-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_FLASH_STD" edc:codeguardidref="PgmBootStdMed" edc:desc="Standard Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="STRD_MEDIUM_BOOT_CODE" edc:codeguardidref="StdMedBootCode" edc:desc="Standard Security, Medium-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_FLASH_STD" edc:codeguardidref="PgmBootStdLarge" edc:desc="Standard Security, Large-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="STRD_LARGE_BOOT_CODE" edc:codeguardidref="StdLarBootCode" edc:desc="Standard Security, Large-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="" edc:desc="No Boot program Flash segment" edc:isidehidden="true" edc:islanghidden="true" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_FLASH_HIGH" edc:codeguardidref="PgmBootHighSm" edc:desc="High Security, Small-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_SMALL_BOOT_CODE" edc:codeguardidref="HiSmBootCode" edc:desc="High Security, Small-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_FLASH_HIGH" edc:codeguardidref="PgmBootHighMed" edc:desc="High Security, Medium-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_MEDIUM_BOOT_CODE" edc:codeguardidref="HiMedBootCode" edc:desc="High Security, Medium-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_FLASH_HIGH" edc:codeguardidref="PgmBootHighLarge" edc:desc="High Security, Large-sized Boot Flash" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="HIGH_LARGE_BOOT_CODE" edc:codeguardidref="HiLarBootCode" edc:desc="High Security, Large-sized Boot Flash" edc:isidehidden="true" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="RBS" edc:desc="Boot Segment RAM Protection" edc:mask="0x3" edc:name="RBS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NO_RAM" edc:codeguardidref="DataBootNone" edc:desc="No Boot RAM" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="NO_BOOT_RAM" edc:codeguardidref="NoBootRam" edc:desc="No Boot RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_RAM" edc:codeguardidref="DataBootSmall" edc:desc="Small-sized Boot RAM" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="SMALL_BOOT_RAM" edc:codeguardidref="SmallBootRam" edc:desc="Small-sized Boot RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_RAM" edc:codeguardidref="DataBootMed" edc:desc="Medium-sized Boot RAM" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="MEDIUM_BOOT_RAM" edc:codeguardidref="MedBootRam" edc:desc="Medium-sized Boot RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_RAM" edc:codeguardidref="DataBootLarge" edc:desc="Large-sized Boot RAM" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="LARGE_BOOT_RAM" edc:codeguardidref="LarBootRam" edc:desc="Large-sized Boot RAM" edc:isidehidden="true" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
